---
kind: method
id: M:Autodesk.Revit.UI.SelectionUIOptions.GetSelectionUIOptions
source: html/8a9113ab-3051-9bca-6f1f-90a6a7a8f7a4.htm
---
# Autodesk.Revit.UI.SelectionUIOptions.GetSelectionUIOptions Method

Returns the current user's SelectionOptions.

## Syntax (C#)
```csharp
public static SelectionUIOptions GetSelectionUIOptions()
```

## Returns
The SelectionOptions for the current user.